import { BarChart, Card, Title } from "@tremor/react";

const chartdata2 = [
  {
    name: "OZON",
    "Заработная плата и персонал": 890,
    "Операционные расходы": 338,
    "Маркетинг и реклама": 538,
    "ИТ-расходы": 396,
    "Финансовые расходы": 138,
    "Исследования и разработки": 436,
  },
  {
    name: "ВУШ ХОЛДИНГ",
    "Заработная плата и персонал": 289,
    "Операционные расходы": 233,
    "Маркетинг и реклама": 253,
    "ИТ-расходы": 333,
    "Финансовые расходы": 133,
    "Исследования и разработки": 533,
  },
  {
    name: "HeadHunter",
    "Заработная плата и персонал": 380,
    "Операционные расходы": 535,
    "Маркетинг и реклама": 352,
    "ИТ-расходы": 718,
    "Финансовые расходы": 539,
    "Исследования и разработки": 234,
  },
  {
    name: "АСТРА Групп",

    "Заработная плата и персонал": 90,
    "Операционные расходы": 98,
    "Маркетинг и реклама": 28,
    "ИТ-расходы": 33,
    "Финансовые расходы": 61,
    "Исследования и разработки": 53,
  },
];

const valueFormatter = (number) =>
  `${new Intl.NumberFormat("us").format(number).toString()} млн. ₽`;

const Graphics = () => (
  <Card>
    <Title>График расходов компаний за квартал</Title>
    <BarChart
      className="mt-6"
      data={chartdata2}
      index="name"
      categories={[
        "Заработная плата и персонал",
        "Операционные расходы",
        "Маркетинг и реклама",
        "ИТ-расходы",
        "Финансовые расходы",
        "Исследования и разработки",
      ]}
      colors={["blue", "teal", "amber", "rose", "indigo", "emerald"]}
      valueFormatter={valueFormatter}
      yAxisWidth={48}
    />
  </Card>
);

export default Graphics;
